source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/ParaDeMinasMG.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<RecepcionarLoteRps versao="2.01">
			<Descricao>Recepcionar Lote RPS</Descricao>
			<WebEnderecoProducao>https://parademinas.mg.issqn.quasar.srv.br/nfe/snissdigitalsvc</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><RecepcionarLoteRps xmlns="http://ws.supernova.com.br/"><xml xmlns="">{xmlBodyScape}</xml></RecepcionarLoteRps></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>soap:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</RecepcionarLoteRps>
		<RecepcionarLoteRpsSincrono versao="2.01">
			<Descricao>Recepcionar Lote RPS Sincrono</Descricao>
			<WebEnderecoProducao>https://parademinas.mg.issqn.quasar.srv.br/nfe/snissdigitalsvc</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><RecepcionarLoteRpsSincrono xmlns="http://ws.supernova.com.br/"><xml xmlns="">{xmlBodyScape}</xml></RecepcionarLoteRpsSincrono></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>soap:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</RecepcionarLoteRpsSincrono>
		<GerarNfse versao="2.01">
			<Descricao>Gerar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoProducao>https://parademinas.mg.issqn.quasar.srv.br/nfe/snissdigitalsvc</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GerarNfse xmlns="http://ws.supernova.com.br/"><xml xmlns="">{xmlBodyScape}</xml></GerarNfse></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>soap:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</GerarNfse>
		<CancelarNfse versao="2.01">
			<Descricao>Cancelar nota fiscal de serviço</Descricao>
			<WebEnderecoProducao>https://parademinas.mg.issqn.quasar.srv.br/nfe/snissdigitalsvc</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CancelarNfse xmlns="http://ws.supernova.com.br/"><xml xmlns="">{xmlBodyScape}</xml></CancelarNfse></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>soap:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</CancelarNfse>
		<SubstituirNfse versao="2.01">
			<Descricao>Substituir nota fiscal de Serviço</Descricao>
			<WebEnderecoProducao>https://parademinas.mg.issqn.quasar.srv.br/nfe/snissdigitalsvc</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<TagExtraAssinatura></TagExtraAssinatura>
			<TagExtraAtributoID></TagExtraAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><SubstituirNfse xmlns="http://ws.supernova.com.br/"><xml xmlns="">{xmlBodyScape}</xml></SubstituirNfse></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>soap:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</SubstituirNfse>
		<ConsultarLoteRps versao="2.01">
			<Descricao>Consulta lote RPS</Descricao>
			<WebEnderecoProducao>https://parademinas.mg.issqn.quasar.srv.br/nfe/snissdigitalsvc</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarLoteRps xmlns="http://ws.supernova.com.br/"><xml xmlns="">{xmlBodyScape}</xml></ConsultarLoteRps></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>soap:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</ConsultarLoteRps>
		<ConsultarNfsePorRps versao="2.01">
			<Descricao>Consulta NFSe por RPS</Descricao>
			<WebEnderecoProducao>https://parademinas.mg.issqn.quasar.srv.br/nfe/snissdigitalsvc</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfsePorRps xmlns="http://ws.supernova.com.br/"><xml xmlns="">{xmlBodyScape}</xml></ConsultarNfsePorRps></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>soap:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</ConsultarNfsePorRps>
		<ConsultarNfseServicoPrestado versao="2.01">
			<Descricao>Consulta NFSe de serviços prestados</Descricao>
			<WebEnderecoProducao>https://parademinas.mg.issqn.quasar.srv.br/nfe/snissdigitalsvc</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfseServicoPrestado xmlns="http://ws.supernova.com.br/"><xml xmlns="">{xmlBodyScape}</xml></ConsultarNfseServicoPrestado></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>soap:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</ConsultarNfseServicoPrestado>
		<ConsultarNfseServicoTomado versao="2.01">
			<Descricao>Consulta NFSe de serviços tomados</Descricao>
			<WebEnderecoProducao>https://parademinas.mg.issqn.quasar.srv.br/nfe/snissdigitalsvc</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfseServicoTomado xmlns="http://ws.supernova.com.br/"><xml xmlns="">{xmlBodyScape}</xml></ConsultarNfseServicoTomado></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>soap:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</ConsultarNfseServicoTomado>
		<ConsultarNfseFaixa versao="2.01">
			<Descricao>Consulta NFSe por Faixa</Descricao>
			<WebEnderecoProducao>https://parademinas.mg.issqn.quasar.srv.br/nfe/snissdigitalsvc</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfseFaixa xmlns="http://ws.supernova.com.br/"><xml xmlns="">{xmlBodyScape}</xml></ConsultarNfseFaixa></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>soap:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>2.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</ConsultarNfseFaixa>
		<!--Versão 1.01 da RTC-->
		<GerarNfse versao="1.01">
			<Descricao>Gerar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoProducao></WebEnderecoProducao>
			<WebEnderecoHomologacao>https://parademinas.mg.des.issqn.quasar.tec.br/nfe/snissdigitalsvc?wsdl</WebEnderecoHomologacao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura>DPS</TagAssinatura>
			<TagAtributoID>infDPS</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:RecepcionarDps><xml>{xmlBodyScape}</xml></ws:RecepcionarDps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:RecepcionarDpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
			<UsaCertificadoDigital>false</UsaCertificadoDigital>
		</GerarNfse>
		<CancelarNfse versao="1.01">
			<Descricao>Cancelar nota fiscal de serviço</Descricao>
			<WebEnderecoProducao></WebEnderecoProducao>
			<WebEnderecoHomologacao>https://parademinas.mg.des.issqn.quasar.tec.br/nfe/snissdigitalsvc?wsdl</WebEnderecoHomologacao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura>pedRegEvento</TagAssinatura>
			<TagAtributoID>infPedReg</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:RecepcionarEventoCancelamentoDps><xml>{xmlBodyScapeRetorno}</xml></ws:RecepcionarEventoCancelamentoDps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:RecepcionarEventoCancelamentoDpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</CancelarNfse>
		<ConsultarNfsePorRps versao="1.01">
			<Descricao>Consulta NFSe por RPS</Descricao>
			<WebEnderecoProducao></WebEnderecoProducao>
			<WebEnderecoHomologacao>https://parademinas.mg.des.issqn.quasar.tec.br/nfe/snissdigitalsvc?wsdl</WebEnderecoHomologacao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType></WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.supernova.com.br/"><soapenv:Header/><soapenv:Body><ws:ConsultarDps><xml>{xmlBodyScape}</xml></ws:ConsultarDps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns2:ConsultarDpsResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.01</SchemaVersao>
			<TargetNS>http://ws.supernova.com.br/</TargetNS>
		</ConsultarNfsePorRps>
	</Servicos>
</Configuracoes>